<a href="https://colab.research.google.com/github/KJM94/Team_project/blob/main/%EB%8D%B0%EC%9D%B4%EC%BD%98_%EB%B6%80%EB%8F%99%EC%82%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **주택공급지표를 이용한 지역별 주택공급량 시각화**

## 목차
    - 1) 입주예정물량과 매매가격지수의 관계
    - 2) 주택값 급등에 따른 미분양주택감소+광역시별 미분양
    - 3) 주택인허가,착공주택
    - 4) 분양실적, 준공실적

In [1]:
from google.colab import drive

drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import os

os.chdir('/content/drive/MyDrive/Colab Notebooks/housedata')

In [3]:
import pandas as pd

한글 폰트 설정

In [4]:
!sudo apt-get install -y fonts-nanum
!sudo fc-cache -fv
!rm ~/.cache/matplotlib -rf

Reading package lists... Done
Building dependency tree
Reading state information... Done
The following package was automatically installed and is no longer required:
  libnvidia-common-460
Use 'sudo apt autoremove' to remove it.
The following NEW packages will be installed:
  fonts-nanum
0 upgraded, 1 newly installed, 0 to remove and 34 not upgraded.
Need to get 9,604 kB of archives.
After this operation, 29.5 MB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu bionic/universe amd64 fonts-nanum all 20170925-1 [9,604 kB]
Fetched 9,604 kB in 1s (10.1 MB/s)
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 1.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package fonts-nanum.
(Reading database ... 160706 files and directories currently installed.)
Preparing to unpack .../fonts-nanum_20170925-1_all.deb ...
Unpacking fonts-nanum (20170925-1) ...
Setting up fonts-nanum (20170925-1) ...
Processing triggers for fontconfig (2.12.6-0ubuntu2) ...
/usr/share/fonts: caching, new cache contents: 0 fonts, 1 dirs
/usr/share/fonts/truetype: caching, new cache contents: 0 fonts, 3 dirs
/usr/share/fonts/truetype/humor-sans: caching, new cache contents: 1 fonts, 0 dirs
/usr/share/fonts/truetype/liberation: caching, new cache contents: 16 fonts, 0 dirs
/usr/share/fonts/truetype/nanum: caching, new cache contents: 10 fonts, 0 dirs
/usr/local/share/fonts: caching, new cache contents: 0 fonts, 0 dirs
/root/.local/share/fonts: skipping, no such directory
/root/.fonts: skipping, no such directory
/var/cache/fontconfig: cleaning cache directory
/root/.cache/fontconfig: not cleaning non-existent cache directory
/root/.fontconfig: not cleaning non-existent cache directory
fc-cache: succeeded

In [5]:
build_df = pd.read_csv('건축허가현황.csv')
money_df = pd.read_csv('국내건설수주액.csv')
house_df = pd.read_csv('미분양주택현황.csv')
buildre_df = pd.read_csv('주택건설인허가실적.csv')
kbsell_df = pd.read_csv('주택매매가격지수(KB).csv')
region_df = pd.read_csv('지역별_지가변동률.csv')

주택착공실적, 주택준공실적, 주택공급실적, 입주예정물량에 대한 외부 데이터 불러오기

In [8]:
# 출처 : https://www.r-one.co.kr/rone/resis/statistics/statisticsViewer.do?menuId=HOUSE_21111 한국부동산원
checkgong_df = pd.read_excel('주택건설인허가실적,착공주택2.xlsx')
# 출처 : https://www.r-one.co.kr/rone/resis/statistics/statisticsViewer.do?menuId=LFR_11100 한국부동산원
joongong_df = pd.read_excel('분양,공급실적.xlsx')
# 출처 : https://aptgin.com/home/sub04/Sub0402.do?_menuNo=144 부동산지인
ipjoo_df = pd.read_excel('입주예정물량.xlsx')

In [9]:
build_df.head()

   Unnamed: 0  연면적-철근·철골조[㎡]  ...  동수-자재별[동수]  동수-용도별[동수]
0  2000-08-01      3898712.0  ...      6671.0      6671.0
1  2000-09-01      3055754.0  ...      5901.0      5901.0
2  2000-10-01      4104565.0  ...      7504.0      7504.0
3  2000-11-01      4337103.0  ...      6775.0      6775.0
4  2000-12-01      6027008.0  ...      5578.0      5578.0

[5 rows x 23 columns]

In [10]:
money_df.head()

   Unnamed: 0  총수주액[백만원]  공공부문[백만원]  ...  기계설치[백만원]  기타[백만원].1  조경공사[백만원]
0  1976-01-01    12592.0     9664.0  ...      239.0       34.0        NaN
1  1976-02-01     8230.0     4156.0  ...      691.0      475.0        NaN
2  1976-03-01    22261.0    14173.0  ...      717.0      269.0        NaN
3  1976-04-01    45920.0    25729.0  ...     6694.0     1252.0        NaN
4  1976-05-01    48992.0    43014.0  ...      598.0     1579.0        NaN

[5 rows x 31 columns]

In [11]:
house_df.head()

   Unnamed: 0    전국[호]  서울[호]   부산[호]  ...    경남[호]  제주[호]  수도권[호]  세종[호]
0  2007-01-01  75616.0  697.0  8680.0  ...  11772.0   77.0  4544.0    NaN
1  2007-02-01  73619.0  590.0  8653.0  ...  11563.0   96.0  4263.0    NaN
2  2007-03-01  73162.0  687.0  8548.0  ...  11328.0  188.0  3532.0    NaN
3  2007-04-01  73393.0  685.0  8074.0  ...  12149.0  162.0  3392.0    NaN
4  2007-05-01  78571.0  704.0  7964.0  ...  11723.0  156.0  3554.0    NaN

[5 rows x 20 columns]

In [12]:
buildre_df.head()

   Unnamed: 0     전국[호]   부산[호]   충북[호]  ...    부문별[호]  세종[호]   서울[호]   울산[호]
0  2007-01-01   12038.0   455.0   188.0  ...   12038.0    NaN  1530.0   183.0
1  2007-02-01   29789.0  1554.0   493.0  ...   29789.0    NaN  2324.0  1356.0
2  2007-03-01   49827.0  3675.0  1187.0  ...   49827.0    NaN  4212.0  2041.0
3  2007-04-01   69013.0  4039.0  1651.0  ...   69013.0    NaN  6175.0  4322.0
4  2007-05-01  100210.0  4936.0  2331.0  ...  100210.0    NaN  8041.0  4566.0

[5 rows x 22 columns]

In [13]:
kbsell_df.head()

   Unnamed: 0  총지수[2019.01=100]  ...  아파트(서울)[2019.01=100]  총지수(서울)[2019.01=100]
0  1986-01-01            34.656  ...                17.153                30.044
1  1986-02-01            34.656  ...                17.183                30.044
2  1986-03-01            34.708  ...                17.153                30.002
3  1986-04-01            34.449  ...                17.034                29.837
4  1986-05-01            34.293  ...                16.945                29.588

[5 rows x 7 columns]

In [14]:
region_df.head()

   Unnamed: 0  전국[%]  서울[%]  부산[%]  대구[%]  ...  전북[%]  전남[%]  경북[%]  경남[%]  제주[%]
0  2005-01-01  0.226  0.192  0.083  0.212  ...  0.108  0.099  0.163  0.140  0.150
1  2005-02-01  0.184  0.140  0.065  0.208  ...  0.084  0.071  0.135  0.160  0.111
2  2005-03-01  0.348  0.403  0.119  0.278  ...  0.085  0.139  0.161  0.225  0.102
3  2005-04-01  0.525  0.725  0.151  0.258  ...  0.071  0.127  0.209  0.291  0.181
4  2005-05-01  0.562  0.590  0.185  0.254  ...  0.094  0.152  0.224  0.310  0.247

[5 rows x 19 columns]

In [15]:
checkgong_df.head()

     연도  서울(주택인허가)  서울(착공주택)  ...  제주(착공주택)  시별종합(주택인허가)  시별종합(착공실적)
0  2013      77621     62223  ...      6118       187659      168741
1  2014      65249     62013  ...     10182       165004      188162
2  2015     101235    116450  ...     19234       261522      294004
3  2016      74739     81413  ...     20060       243611      220339
4  2017     113131     86890  ...     12730       280878      206051

[5 rows x 21 columns]

In [16]:
joongong_df.head()

     연도          지역      실적    매매가격지수
0  2013  시별종합(분양실적)   50167  89.05000
1  2013  시별종합(준공실적)  173120   0.00000
2  2014  시별종합(분양실적)   64652  91.16481
3  2014  시별종합(준공실적)  197783   0.00000
4  2015  시별종합(분양실적)   81979  94.72593

In [17]:
ipjoo_df.head()

     연도       지역  입주예정물량
0  2013  세종특별자치시    4444
1  2014  세종특별자치시   19550
2  2015  세종특별자치시   19941
3  2016  세종특별자치시    8576
4  2017  세종특별자치시   16028

## **결론**

지금까지 지표를 봤을 때 모든 지표가 대부분의 지역이 수요에 비하여 공급량이 턱없이 부족하고 그로 인해 매매가격지수는 끝없이 증가하여

어느정도 공급량이 남아있는 지역조차도 주택미보유자들이 주택을 분양 받기 힘든 상황이다.

빈익빈 부익부라고 했던가 거주를 생각하지 않고 투기로서 부동산을 바라보고 있는 사람들이 공급량을 초토화시키고, 공급량이 부족한 만큼

매매가격지수가 천정부지로 솟아올라 다음 순위 구매자들이 정작 공급량이 남아있음에도 불구하고 집을 구매하지 못하는 상황이 발생하고 있다.

또한 대출규제로 인하여 받을 수 있는 대출금은 줄었으나 집값이 많이 상승하여

자본금이 부족한 국민은 대출금을 최대로 받아도 집을 구매할 수 없는 상황들이 발생하고 있다.

따라서 부동산 정책과 규제를 정비하여 부동산 투기자들의 투기를 억제시켜야 한다.

단, 과도한 정부의 부동산 규제는 시장에 악영향을 미칠 수 있으므로 적당한 규제와 허점을 보완하는 정책을 시행함으로써 시장의 흐름에 맡겨야 된다고 생각한다